{
  "title": "Jodie Whittaker's massaman curry",
  "yield": "6 servings",
  "ttime": "2 Hour and 45 Minutes",
  "ingr": [
    "30 g peanuts",
    "500 g beef",
    "400 ml coconut milk",


    
  ],
    "prep": "1. To make the paste, toast the chillies in a wok on a medium heat for 3 to 4 minutes. Pound in a pestle and mortar with 2 teaspoons of sea salt until fine. 2. Toast the coriander seeds, cloves, fennel seeds and white peppercorns in the wok for 3 minutes on a low heat. Tip into your pestle and mortar with the chillies, add 1 tablespoon of coconut cream and pound to a paste – put some welly into it! 3. Peel the lime zest, then finely chop the rind and pound with the chillies. 4. Peel and finely slice the galangal, trim the lemongrass, discarding the tough outer layer, and finely chop. Peel the garlic, wash and chop the coriander roots or stalks, and peel and finely slice the shallots (setting aside a large handful of sliced shallots for later). Char your chopped ingredients in a hot wok over a high heat for 2 to 3 minutes. 5. Add your charred ingredients to the paste mixture and continue to pound until smooth, adding 1-2 tablespoons more of coconut cream if needed. Alternatively, scrape the paste and charred ingredients into a liquidiser with a little extra coconut cream and pulse until smooth. 6. Add the shrimp paste to the wok, fry it off for 1 minute, then bash or whiz with your curry paste until combined. (You now have enough paste for another 5 or 6 curries). 7. To make the curry, toast the peanuts in a dry wok for 3 to 4 minutes or until golden, then set aside. 8. Roughly chop the meat into 4cm chunks. 9. Put your wok back on a medium heat and add 75ml coconut cream and 2 heaped tablespoons of the curry paste. Give it a good stir and let it bubble away for a couple of minutes. 10. Tip in the beef, peanuts and coconut milk, and bring to the boil. 11. Reduce the heat to low, cover, and leave to tick away for 45 minutes, stirring occasionally. 12. Peel and roughly chop the onion, then peel the potatoes and chop into 3cm chunks. Add to the wok, along with the fish sauce and palm sugar, then give everything a good stir. Cover and continue cooking for 25 minutes, or until the sauce has thickened and the potato is soft, adding a splash of boiling water to loosen, if necessary. Have a taste and season with a little more fish sauce, if needed. 13. For the salad, trim the beans and steam with the bok choi for 3 minutes or until just cooked – you want the beans to be soft enough to bend, but with a little bite. Run under cold water and then cut into three and tie into knots. Shave the carrots into long ribbons with a speed peeler, then score the length of the cucumber with a fork and slice into rounds. Arrange on a platter with the beansprouts and fresh herbs. 14. For the dressing, peel and finely chop the garlic and galangal, deseed and finely chop the chilli. Finely zest 1 lime, then roll and squeeze the juice of both into a small bowl. Add the garlic, galangal, chilli, fish sauce, vinegar and sugar, and whisk to combine. Pour over the salad just before serving. 15. Cook the rice according to the packet instructions. 16. Heat 4 tablespoons of vegetable oil in a pan over medium-high heat and fry the reserved shallots until golden and crispy. Tip onto a plate lined with kitchen paper and leave to drain. 17. Scatter the crispy shallots over the rice and serve with the curry and salad."}
