{
  "title": "Mark Hamill's roast sirloin & Yorkshire puddings",
  "yield": "6 servings",
  "ttime": "6 hours 20 minutes",
  "ingr": [
    "4 eggs",
    "150 g plain flour",
    "175 ml whole milk",
    "50 g beef dripping",
    "2 kg beef bones",
    "2 large leeks",
    "2 red onions",
    "2 heaped tablespoons plain flour",
    "100 ml red wine",
    "100 ml port",
    "2 kg whole dry-aged sirloin of beef",
    "olive oil",
    "40 g black peppercorns",
    "3 sprigs of fresh rosemary"
  ],
    "prep": "1. Ideally, make your Yorkie batter the night before. Whisk the eggs, flour, milk, 25ml of water and a pinch of sea salt to a smooth batter, then pop into the fridge overnight, removing when you preheat the oven for the meat (or, as a minimum, make the day you need it but leave to rest at room temperature for at least 30 minutes). 2. Preheat the oven to 180ºC/350ºF/gas 4. 3. For the gravy, place the bones in a large roasting tray. Trim, wash and roughly chop the leeks, quarter the unpeeled onions, then add to the tray and roast for 45 minutes, or until golden brown. 4. Remove the bones and veg to a large pot, keeping the tray of juices to one side. Top up the pot with 2.5 litres of water, bring to the boil, then reduce to a simmer for at least 2 hours 30 minutes, or until the liquid has reduced by half. 5. Place the tray over a medium heat on the hob, then add the flour and stir well to pick up any sticky bits from the bottom. Pour in the wine and port, leave to bubble away for 1 minute, then gradually whisk in a few ladles of the stock, before tipping it all back into the pot. 6. Simmer gently for a further 2 hours, or until you reach your desired consistency. 7. Lift out the bones and strain the gravy, skimming off any fat from the surface, then adjust the seasoning, if needed. Keep aside to reheat at the last minute. 8. When you’re ready, remove the beef from the fridge and leave to come up to room temperature. Turn the oven up to full whack (240ºC/475ºF/gas 9). 9. Score the beef fat in a criss-cross fashion, then rub with 1 tablespoon of oil. 10. In a blender, blitz the peppercorns, 1 tablespoon of salt and the rosemary leaves to a fine dust, then sprinkle and pat all over the beef. 11. Place a large roasting tray on a medium-high heat, carefully sear the beef on all sides, then transfer to the oven. 12. Immediately reduce the temperature to 180ºC/350ºF/gas 4 and roast for 50 minutes – this will give you medium-rare (cook for a little longer, if you prefer) – then remove to a board. Cover and rest for 30 minutes. 13. Turn the oven up to 220ºC/425ºF/gas 7. 14. Divide the dripping between a 6-well deep Yorkshire pudding tray (8.3g per well, if you want to be super-scientific about it!), then place on the middle shelf of the oven for 5 minutes, or until the fat is smoking hot. 15. Quickly but carefully pour the batter into the wells – each should be between half and three-quarters full. Immediately return to the oven and bake for 25 minutes, or until they have quadrupled in volume, are deep golden all over and sound hollow when tapped. 16. Carve and serve up the beef, adding a Yorkshire pudding to each plate, then drizzle with gravy (reheat, if needed). Delicious served with pinches of lemon-dressed watercress, horseradish and crispy roast potatoes. Tips Make your Yorkshire pudding batter in a large jug – it’ll make your life so much easier when you’re pouring it into the smoking hot fat"}