{
  "title": "Stephen Mangan's Sri Lankan fish curry",
  "yield": "2 servings",
  "ttime": "40 Minutes",
  "ingr": [
    "35 g goraka",
    "1 clove of garlic",
    "2 cm piece of ginger",
    "0.5 pandan leaf",
    "1 large pinch of ground cinnamon",
    "0.5 teaspoon ground black pepper",
    "20 fresh curry leaves",
    "300 g yellowfin tuna",
    "2 banana leaves",
    "dried red chilli flakes",
    "2 ripe tomatoes",
    "1 fresh green chilli",
    "0.5 fresh coconut",
    "2 limes",
    "0.5 onion",
    "1 clove of garlic",
    "1 small knob of unsalted butter",
    "2 pandan leaves",
    "10 curry leaves",
    "1 small pinch of ground turmeric",
    "150 g basmati rice"
],

    "prep": "1. Boil the goraka in a pan of boiling water for about 20 minutes, or until softened. 2. Peel and roughly chop the garlic and ginger, and roughly chop the pandan. 3. Place the softened goraka (or tamarind paste), garlic, ginger and pandan in a pestle and mortar, along with the cinnamon, black pepper, curry leaves and a good pinch of salt. Give it a good bash until everything has broken down. 4. Add 3 tablespoons of boiling water and muddle to make a smooth paste. 5. Cut the tuna into 6 even chunks, rub all over with the paste, then leave to marinate for 20 minutes. 6. Meanwhile, for the rice, peel and finely chop the onion and garlic, then place in a shallow pan on a medium heat with the butter. Roughly chop the pandan and add to the pan. Tear in the curry leaves, then give everything a good stir and cook for 8 minutes or until softened, but not coloured. 7. Stir in the turmeric, add the rice and cook for a few minutes more. 8. Pour in 2 mugfuls (300ml) of boiling water, season with a good pinch of sea salt, then pop the lid and cook for 8 to 10 minutes, or until all the water is absorbed. Turn off the heat and leave it to steam for a further 10 minutes. 9. Line a lidded clay pot or a small cast iron pan with a piece of banana leaf. Pop the fish in the bottom in a single layer, then cover with another piece of banana leaf, and the lid. Place the pan on the hob over a low heat and cook for 10 to 15 minutes, or until just cooked through. 10. To make the sambal, deseed and finely chop the tomatoes, and trim and finely slice the chilli (deseed if you like). Scrape out the coconut with a fork (about 100g) and combine in a bowl with the tomato and chilli. Finely zest over the limes, then squeeze in the juice and season to taste. 11. Line 2 plates with banana leaves and arrange a little bit of everything on each. Garnish with extra shaved coconut and chilli flakes, if you like. Tips: To make your banana leaf a little more malleable, carefully heat it over a gas hob to release the natural oils. Easy!"}