{
  "title": "Russell Howard's chicken & prawn curry",
  "yield": "6 servings",
  "ttime": "1 Hour",
  "ingr": [
    "600 ml organic chicken stock",
    "300 g coconut cream",
    "400 ml coconut milk",
    "160 g tamarind paste",
    "4 sticks of lemongrass",
    "4 Asian shallots",
    "400 g minced chicken breast",
    "2 long fresh red chillies",
    "15 g of fresh coriander",
    "400 g raw tiger prawns",
    "8 teaspoons palm sugar",
    "8 tablespoons fish sauce",
    "2 limes",
    "crispy shallots",
    "200 g Thai sticky rice",
    "500 ml vegetable oil"
  ],

    "prep": "1. To make the rice cakes, cover the rice with cold water and leave to soak overnight. 2. Drain the rice, then spread it out evenly in a lined bamboo steamer (about 5mm thick). Set the steamer in a wok over boiling water, then cover and steam for 20 minutes. 3. Preheat the oven to 80°C/176°F (or to its lowest setting). Remove the rice from the wok and allow to cool a little. Wet your hands and lightly pick up small clumps of rice with your fingertips, being careful not to squash the grains together, and transfer to a wire rack set over a baking tray. Dry in the oven for 2 hours. 4. Put the vegetable oil in a wok or large heavy-based saucepan (unless you own a deep-fat fryer) and place on a medium-high heat to bring up to 170°C–180°C, or add a cube of bread – if it turns golden in about 30 seconds, you’re good to go. 5. Fry the rice in small batches, holding them under the oil if needed with a slotted spoon, for 30 to 45 seconds, or until puffed up and crisp, turning to cook evenly on both sides. Carefully remove with your slotted spoon to kitchen paper before they colour, while you cook the next batch. Leave to cool and store in an airtight container until ready to serve. 6. For the curry, heat the chicken stock in a large pan on a medium heat, add the coconut cream, coconut milk and tamarind, and gently bring to the boil. 7. Meanwhile, whack the lemongrass against your work surface and remove the tough outer layer. Peel the shallots, then very finely chop with the inside of the lemongrass, and add to the pan. 8. Stir in the minced chicken and cook for 4 minutes, stirring to break up any lumps. 9. Trim the chillies and finely chop with the coriander stalks, roughly chop the prawns. Add it all to the pan with the palm sugar and fish sauce. 10. Finely grate over the zest of 1 lime, and squeeze in the juice, then leave to simmer for 5 minutes. Have a taste and adjust the seasoning, adding a little more lime juice, fish sauce or sugar, if needed. Scatter over the remaining coriander. 11. Serve the curry with the rice cakes and a scattering of crispy shallots, if you like (see tip). Delicious with a fresh green salad. Tips To make your own crispy shallots, peel and finely slice Asian shallots, toss in plain flour, then deep-fry until golden and crisp. Drain on kitchen paper and scatter over your curry. Yum!"}