{
  "title": "Beautiful courgette carbonara",
  "yield": "6 servings",
  "ttime": "20 Minutes",
  "ingr": [
    "6 medium green and yellow courgettes",
    "500 g penne",
    "4 large free-range eggs",
    "4 teaspoons salt",
    "100 ml single cream",
    "1 small handful of Parmesan cheese",
    "olive oil",
    "6 slices of higher-welfare back bacon",
    "15g of fresh thyme ",
    "a few courgette flowers , (optional)"
  ],
    "prep": "Put a large pan of salted water on to boil. Halve and then quarter any larger courgettes lengthways. Cut out and discard any fluffy middle bits, and slice the courgettes at an angle into pieces roughly the same size and shape as the penne. Smaller courgettes can simply be sliced finely. Your water will now be boiling, so add the penne to the pan and cook according to the packet instructions. To make your creamy carbonara sauce, separate the eggs and put the yolks into a bowl (saving the whites for another recipe). Add the cream and grate in half the Parmesan, and mix together with a fork. Season lightly with sea salt and black pepper, and put to one side. Heat a very large frying pan (a 35cm one is a good start – every house should have one!) and add a good splash of olive oil. Cut the pancetta or bacon into chunky lardons and fry until dark brown and crisp. Add the courgette slices and 2 big pinches of black pepper, not just to season but to give it a bit of a kick. Pick, chop and sprinkle in the thyme leaves (reserving any flowers), give everything a stir, so the courgettes become coated with all the lovely bacon-flavoured oil, and fry until they start to turn lightly golden and have softened slightly. It’s very important to get this next bit right or your carbonara could end up ruined. You need to work quickly. When the pasta is cooked, drain it, reserving a little of the cooking water. Immediately, toss the pasta in the pan with the courgettes, bacon and lovely flavours, then remove from the heat and add a ladleful of the reserved cooking water and your creamy sauce. Stir together quickly. (No more cooking now, otherwise you’ll scramble the eggs.) Get everyone around the table, ready to eat straight away. While you’re tossing the pasta and sauce, grate in the rest of the Parmesan and add a little more of the cooking water if needed, to give you a silky and shiny sauce. Taste quickly for seasoning. If you’ve managed to get any courgette flowers, tear them over the top, then serve and eat immediately, as the sauce can become thick and stodgy if left too long."
}