{
  "title": "Sir Patrick Stewart's mole enchiladas",
  "yield": "12 servings",
  "ttime": "2 Hours 30 Minutes",
  "ingr": [
    "1 onion",
    "2 carrots",
    "100 g celery",
    "10 g garlic",
    "2 kg chicken",
    "1 teaspoon black peppercorns",
    "30 g parsley",
    "12 corn tortillas",
    "30g coriander",

  ],

    "prep": "1. To poach the chicken, cut the onion into quarters (leaving the skin on), scrub and halve the carrots, trim and roughly chop the celery, halve the bulb of garlic. Place it all into a large, deep pot with the chicken, peppercorns and parsley. Cover with cold water, then add 1 teaspoon of sea salt and place on a high heat. Bring to the boil, then reduce the heat to medium-low and simmer for 1½ hours, or until the chicken is cooked through and falling away from the bone, skimming away and discarding any scum that rises to the surface. Turn off the heat and leave the chicken to soak in the pot until ready to serve. 2. For the mole, halve and deseed the dried peppers, then lightly toast in a dry frying pan for a couple of minutes (being careful not to char them) – you may need to do this in batches. Tip into a large heatproof bowl, cover with boiling water and leave to soften (about 20 minutes). 3. Meanwhile, heat 1 tablespoon of pork dripping in a large, deep frying pan on a medium heat. Add the sesame seeds, peanuts and almonds, and toast for 5 minutes, or until golden. Remove to a bowl. 4. Add another tablespoon of dripping to the pan. Peel and roughly chop the onions and garlic, then fry with the ground spices for 5 to 10 minutes, or until softened. 5. Peel the plantain and roughly chop with the tomatoes. Add to the pan, along with the raisins and toasted nuts and seeds (reserving 3 tablespoons for serving). 6. Roughly tear in the corn tortilla and bread roll, then drain the peppers and mix everything together in a large bowl ready for blitzing. 7. Working in batches, transfer the mixture to a liquidiser and whiz until smooth, adding a little water to each batch until you reach the desired consistency. Pass the mixture through a coarse sieve into a large pan on a low heat, with 4 tablespoons of dripping. 8. Coarsely grate in the dark chocolate, stir it through the mole, then leave to simmer for 1 hour, or until the flavours have mellowed and the sauce is rich and thick, stirring regularly. Have a taste and season to perfection, adding a little poaching liquor from the chicken to loosen. 9. For the corn salsa, preheat a griddle pan on a medium-high heat. Add the corn and toast for 5 to 8 minutes, or until the kernels are scorched and blackened, turning regularly for even cooking. Alternatively, char the corn directly on a gas hob. Carefully slice the kernels from the cob with a sharp knife. 10. Finely zest 1 lime over a serving bowl, then squeeze in the juice of both limes and add a good pinch of sea salt and black pepper. Peel the red onion and finely dice with the tomatoes, slice the jalapeños (deseed, if you like), then add to the bowl, along with the corn. Toss well and leave to one side. 11. For the green rice, dollop the dripping into a pan on a medium heat. Peel and finely chop the onion and garlic, add to the pan and cook for a couple of minutes. Stir in the rice and cook for a few minutes more, or until the onions are golden and slightly softened. 12. Add 500ml of the chicken poaching liquor or stock, then finely chop the herbs and add to the pan, along with the epazote (if using). Bring to the boil, then reduce the heat to low, cover and simmer for 10 minutes, or until all the water is absorbed and the rice is cooked. 13. Pull the chicken from the carcass and shred the meat. Bash the reserved seeds and nuts in a pestle and mortar to a chunky crumb. 14. Ladle about 500ml of mole into a clean pan and keep warm while you assemble the enchiladas. 15. Working two to three at a time, brush the outside of the tortillas with a little pork dripping, then flip them over and top each with a good handful of chicken. Fold them in half, pressing the edges to seal. 16. Place a large non-stick frying pan on a medium heat and fry the tortillas for 1 to 2 minutes on each side, or until golden and crisp. 17. Dunk the tortillas into the warm mole, then place on a serving plate. Sprinkle over the bashed nuts, then add a dollop of salsa and a few sprigs of coriander. Serve with the green rice. Delicious! Tips This gorgeous mole is ideal for batch cooking, so freeze the leftovers in portions for your next Mexican feast."}
