{
  "title": "Harry Hill's vegetarian thali",
  "yield": "8 servings",
  "ttime": "2 Hour and 30 Minutes",
  "ingr": [
    "200 g peas",
    "1 onion",
    "25 g ginger",

  
  ],
    "prep": "1. For the tarka daal: cook the split peas in a large saucepan of boiling salted water following the packet instructions, then drain. Melt the ghee into a large saucepan on a medium heat. 2. Peel and slice the onion and add to the pan. Peel and mince the ginger and garlic, finely chop the chilli (deseed if you like) and dice the tomatoes. Add to the pan, along with the turmeric and chilli powder, season with sea salt, and give everything a good mix. Add the cooked split peas with 100ml of water and simmer over a low heat for 5 to 10 minutes, or until thickened. 3. Have a taste and season to perfection with salt, black pepper and lemon juice. For garnish, deseed and finely chop the red chilli. Toast the mustard seeds in a small dry frying pan for a few minutes until they start to pop. Scatter the chilli and mustard seeds over the daal just before serving, if you like. 4. For the aloo gobi: peel and finely slice the garlic and the onion. Drizzle the ghee or oil into a medium frying pan on a medium heat, add the garlic and onion, and cook for 10 minutes, or until softened. 5. Peel and chop the potatoes into 2cm cubes, and add to the pan along with the cumin seeds, turmeric, a little sea salt and a splash of water. Give everything a good stir, then cover and cook for 5 to 10 minutes, or until the potatoes have just started to soften. 6. Trim the cauli and chop to the same size as the spuds. Add to the pan along with the peas and another splash of water, and continue cooking for a further 5 minutes. Stir through the remaining spices and cook for a further 10 minutes, or until the veg is soft and fragrant. Roughly chop the coriander and scatter it over just before serving, if you like. 7. For the chilli paneer: trim and finely slice the spring onions and chillies (deseed if you like). Peel and finely slice the ginger and garlic, deseed the red pepper and roughly chop. Drizzle the ghee or oil into a large frying pan, add the ginger, garlic, peppers, most of the spring onions and chilli, and cook for a couple of minutes until fragrant and softened. 8. Add the soy, rice wine vinegar, chilli sauce, sugar, cornflour and 200ml water, give everything a good stir and simmer for 10 minutes until thickened. 9. Cut the paneer into 1½cm chunks and fry in a second pan with a little more ghee or oil until golden and crispy. Stir the paneer through the red pepper sauce and scatter over the remaining spring onions and chilli. 10. For the raita: peel and finely chop the cucumber, deseed and finely chop the tomatoes and chillies. Stir the chopped ingredients into the yoghurt along with the cumin and season to taste with salt. 11. For the parathas: sift the flour into a large mixing bowl with a good pinch of sea salt. Gradually pour in 2 tablespoons of oil and the milk, mixing with a fork until combined, then knead for a few minutes on a flour-dusted surface. Leave to rest for 20 minutes. 12. Rub a clean work surface with oil, then divide the dough into 8 and roll out each piece to A4 size. One-by-one, stretch out the dough and roll it into a giant cigar, then roll it up like a snail. Flatten it out with a rolling pin to just under ½cm thick. Cook in a dry frying pan for 3 minutes on each side, or until golden and crisp, then sprinkle lightly with salt. Transfer to a board and smash together to expose the layers."}
